#include "Loby.h"
#include <iostream>
#include <cstdlib>
#include <thread>
#include <chrono>
using namespace std;

void Loby::PrintLoby()
{
	cout << "┌──────────────────────────────────────────────────────────┐" << endl;
	cout << "│      #####  #####   ####   #   #  #####    ##### ##    # │" << endl;
	cout << "│     #        #    #    #  #   #    #        #   # #   #  │" << endl;
	cout << "│    ####     #    #  ###  #####    #        #   #  #  #   │" << endl;
	cout << "│   #        #    #    #  #   #    #        #   #   # #    │" << endl;
	cout << "│  #      #####   ### #  #   #    #      ##### #    ##     │" << endl;
	cout << "│                                                          │" << endl;
	cout << "│      ###    #   #   #   #    ###    #####   ###    #   # │" << endl;
	cout << "│     #  #   #   #   ##  #   #   #   #      #   #   ##  #  │" << endl;
	cout << "│    #  #   #   #   # # #   # ###   ####   #   #   # # #   │" << endl;
	cout << "│   #  #   #   #   #  ##   #   #   #      #   #   #  ##    │" << endl;
	cout << "│  ###     ###    #   #    ## #   #####   ###    #   #     │" << endl;
	cout << "│                                                          │" << endl;
	cout << "└──────────────────────────────────────────────────────────┘" << endl;
	cout << "            1. 던전에 들어간다   2. 게임 종료              " << endl;
	cout << " ────────────────────────────────────────────────────────── " << endl;
}

void Loby::InputLoby()
{
	cout << "                            > ";
	int input;
	cin >> input;
	if (input == 2)
	{
		exit(0);
	}
}

void Loby::PrintStory(int a)
{
	if (a == 1)
	{
		cout << "	 ...................	 " << endl;
		cout << "	 ....~*:-..      ~;;;	 " << endl;
		cout << "	 ....:~-,. .    .;!!;:	 " << endl;
		cout << "	 ....,~,,.      .!!!!*	 " << endl;
		cout << "	 ....,~--.      -~;;!!.  " << endl;
		cout << "	 ....,-;~.    .,-,-;!!.  " << endl;
		cout << "	 ...*=*-==--,--~~.~!;!.  " << endl;
		cout << "	 ..-###*--~~--~~~=!!!;	 " << endl;
		cout << "	 ..:###:-~~----. !!!!;	 " << endl;
		cout << "	 ..=###$==...    -!;;.	 " << endl;
		cout << "	 ..~###$$=        ~~-	 " << endl;
		cout << "	 ..-$=$$$=. .			 " << endl;
		cout << "	 ...=$$$$=~ ...			 " << endl;
		cout << "	 ....=$$$=~ ....		 " << endl;
		cout << "	 ....=$$$*.......		 " << endl;
		cout << "	 ... $$$=* .......		 " << endl;
		cout << "	 ...=$$$$=..........	 " << endl;
		cout << "	 ...=!$$$=~... ...       " << endl;
		cout << "	 ...!*#$$=!............  " << endl;
		cout << "	 ...;##$$$$............  " << endl;
		cout << "	 ...-##$##$............  " << endl;
		cout << "	 ...-##$##$,...........  " << endl;
		cout << endl;
		cout << "어느 마을에 지상 최강의 사나이를 꿈꾸는 한 남자가 있었다." << endl;
		cout << "늘 단련을 거듭하는 그는 한 생각을 하게 된다." << endl;
		this_thread::sleep_for(chrono::seconds(3));
		system("cls");
	}
	if (a == 2)
	{
		cout << "	      ;=*		 " << endl;
		cout << "	      !=$		 " << endl;
		cout << "	      :$$.		 " << endl;
		cout << "	     ~==*==		 " << endl;
		cout << "	    ;=*$#$!;	 " << endl;
		cout << "	   ,*#~;$$$~;	 " << endl;
		cout << "	   !#!~!$##=,	 " << endl;
		cout << "	  .*@$#$$*:;:;	 " << endl;
		cout << "	  -=$#$*!#$##-	 " << endl;
		cout << "	  ;!===*=@~		 " << endl;
		cout << "	 ,;:!*$#@#		 " << endl;
		cout << "	 :$=;$####!		 " << endl;
		cout << "	 =##$$$$#*=		 " << endl;
		cout << "	.~$#$:=####.	 " << endl;
		cout << "	,-$$$*=##*$#	 " << endl;
		cout << "	,!#$$$=$==$=	 " << endl;
		cout << "	~~$$$==#==$:$	 " << endl;
		cout << "	:*$=*$$#$$$$!	 " << endl;
		cout << "	~*$===@@~#$*.*	 " << endl;
		cout << "	~=$$$*!  $=: :.	 " << endl;
		cout << "	~*$=$#-  =*=  ;	 " << endl;
		cout << "	;=$$=@   =!*  ;	 " << endl;
		cout << "	!=#$$#   ,**	-" << endl;
		cout << endl;
		cout << "나의 강함은 더 이상 인간의 것이 아니다." << endl;
		cout << "그러니 마물과 싸워 나의 강함을 증명해야겠다." << endl;
		cout << "그렇게 말한 그는 갑옷을 챙겨 입었다." << endl;
		this_thread::sleep_for(chrono::seconds(3));
		system("cls");
	}
	if (a == 3)
	{
		cout << "	#$=*  *   $#@$;:$##:~~;:=  ==$	 " << endl;
		cout << "	   ==; $*=#@@@@@@$*==@;;*=$  $	 " << endl;
		cout << "	$=  * ~==@@@@@@ @@#*!*=~!# = $	 " << endl;
		cout << "	$## #;;;@@#@@@@@@#@#*####==*  	 " << endl;
		cout << "	=== #####@@##@@@@ @@$#=;;*$!$=	 " << endl;
		cout << "	$=*  *:;##@###@@@@@ $$*:**==$=	 " << endl;
		cout << "	=!!*!*###@@###@@#@@## ! ##  #:	 " << endl;
		cout << "	$~:##;;~$@## ##@####$$!;  !*=!	 " << endl;
		cout << "	=:  ;##;#@### #@####$$*#*=***!	 " << endl;
		cout << "	=!!!;*##@# ####### ##$$~*#!*==	 " << endl;
		cout << "	   !###;##### ######=#=*= # *=	 " << endl;
		cout << "	**=;::#~#@#######@#@*$*!*:* $ 	 " << endl;
		cout << "	*  :-#:;##### ###@#@=$*;=:*##=	 " << endl;
		cout << "	!=;:#~~:$$#  #######!=$;;###:*	 " << endl;
		cout << "	=#==:~,-#$###### #=#!$## :~ ~=	 " << endl;
		cout << "	=$$=;-#3##*=$###$#=#; ##:: :;=	 " << endl;
		cout << "	$*==###:$$==$$## ###! ##:###!*	 " << endl;
		cout << "	$=###.#~=$ ########=!*==  !;!*	 " << endl;
		cout << "	$#$=;~~:**====*;;;=$*==$***;!=	 " << endl;
		cout << endl;
		cout << "반나절을 걷다가, 던전을 발견한 그는" << endl;
		cout << "강함을 증명하기 위해 던전 앞에 서게 된다.	" << endl;
		this_thread::sleep_for(chrono::seconds(3));
		system("cls");
	}
}